---
title: 2023 年夏秋冬三季短记
date: 2023-11-27 20：08：01
tags: [奇奇怪怪的思考]
categories: [日常、短记]
description: 最近没有更新的时间里我都做了什么
author: 苏
readmore: true
---

关于这段时间我的生活，关于学习、关于成长。

# 夏季
    夏季，刚刚入职新公司，本来对直属 leader 的管理能力还蛮认可，但是时间久了细节处见真章，他对于项目进度的把控、其他兄弟团队的信息沟通和团队内部的协同、氛围，这几项都做的不尽如人意。
    当然，这都不是我最 care 的部分，最让我难受的是 团队内部的技术氛围，可能因为不是互联网公司，对于技术往往是能满足需求即可，而我们团队做的是 ToB 的业务，
    对于一个请求各方面指标的容忍度都很高，导致大伙都没什么积极性去磨炼自己的代码能力。
    
    关于生活，搬了新家，还在原来的小区，只是换了个房间。给家里买了新的电视和洗衣机，不是很贵，但是提升了很多幸福指数。
    
    关于学习，公司内网办公，但是 Docker 和 Kubernetes 对我来说算是新鲜的，稍微了解了一下基本的流程，包括 Rancher 平台如何管理这些 namespace 和 pods，
    Jenkins 如何跟 GitLab 配合，指定分支用 Docker 制作出镜像。

# 秋季
    步入秋季


​    